apim-migration-testing-tool-rest-assured/src/test/payloads/demoCreateTenantRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
 					xmlns:ser="http://services.mgt.tenant.carbon.wso2.org" 
 					xmlns:xsd="http://beans.common.stratos.carbon.wso2.org/xsd">
   <soapenv:Header/>
   <soapenv:Body>
      <ser:addTenant>
         <!--Optional:-->
         <ser:tenantInfoBean>
            <!--Optional:-->
            <xsd:active>false</xsd:active>
            <!--Optional:-->
            <xsd:admin>wso2admin</xsd:admin>
            <!--Optional:-->
            <xsd:adminPassword>wso2admin</xsd:adminPassword>
            <!--Optional:-->
            <xsd:email>wso2admin@test16_wso2.com</xsd:email>
            <!--Optional:-->
            <xsd:firstname>wso2</xsd:firstname>
            <!--Optional:-->
            <xsd:lastname>user</xsd:lastname>
            <!--Optional:-->
            <xsd:successKey>true</xsd:successKey>
            <!--Optional:-->
            <xsd:tenantDomain>test16_wso2.com</xsd:tenantDomain>
            <!--Optional:-->
            <xsd:tenantId>18</xsd:tenantId>
            <!--Optional:-->
            <xsd:usagePlan>demo</xsd:usagePlan>
         </ser:tenantInfoBean>
      </ser:addTenant>
   </soapenv:Body>
</soapenv:Envelope>